Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFG144.atdf
         <register caption="ADC9 Output Data Register" name="ADCDATA9" offset="0x224" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC10 Output Data Register" name="ADCDATA10" offset="0x228" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC11 Output Data Register" name="ADCDATA11" offset="0x22c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC12 Output Data Register" name="ADCDATA12" offset="0x230" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC13 Output Data Register" name="ADCDATA13" offset="0x234" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC14 Output Data Register" name="ADCDATA14" offset="0x238" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC15 Output Data Register" name="ADCDATA15" offset="0x23c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC16 Output Data Register" name="ADCDATA16" offset="0x240" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC17 Output Data Register" name="ADCDATA17" offset="0x244" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC18 Output Data Register" name="ADCDATA18" offset="0x248" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC19 Output Data Register" name="ADCDATA19" offset="0x24c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC20 Output Data Register" name="ADCDATA20" offset="0x250" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC21 Output Data Register" name="ADCDATA21" offset="0x254" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC22 Output Data Register" name="ADCDATA22" offset="0x258" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC23 Output Data Register" name="ADCDATA23" offset="0x25c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC24 Output Data Register" name="ADCDATA24" offset="0x260" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC25 Output Data Register" name="ADCDATA25" offset="0x264" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC26 Output Data Register" name="ADCDATA26" offset="0x268" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC27 Output Data Register" name="ADCDATA27" offset="0x26c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC28 Output Data Register" name="ADCDATA28" offset="0x270" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC29 Output Data Register" name="ADCDATA29" offset="0x274" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC30 Output Data Register" name="ADCDATA30" offset="0x278" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC31 Output Data Register" name="ADCDATA31" offset="0x27c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC32 Output Data Register" name="ADCDATA32" offset="0x280" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC33 Output Data Register" name="ADCDATA33" offset="0x284" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC34 Output Data Register" name="ADCDATA34" offset="0x288" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC35 Output Data Register" name="ADCDATA35" offset="0x28c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC36 Output Data Register" name="ADCDATA36" offset="0x290" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC37 Output Data Register" name="ADCDATA37" offset="0x294" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC38 Output Data Register" name="ADCDATA38" offset="0x298" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC39 Output Data Register" name="ADCDATA39" offset="0x29c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC40 Output Data Register" name="ADCDATA40" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC41 Output Data Register" name="ADCDATA41" offset="0x2a4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC42 Output Data Register" name="ADCDATA42" offset="0x2a8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
