Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFG144.atdf
   <module caption="" id="02787" name="CFG" version="">
      <register-group name="CFG">
         <register caption="Configuration Control Register" name="CFGCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="TDO Enable for 2-Wire JTAG" mask="0x00000001" name="TDOEN" values="CFGCON__TDOEN"/>
            <bitfield caption="Trace Output Enable bit" mask="0x00000004" name="TROEN" values="CFGCON__TROEN"/>
            <bitfield caption="JTAG Port Enable bit" mask="0x00000008" name="JTAGEN" values="CFGCON__JTAGEN"/>
            <bitfield caption="Flash ECC Configuration bits" mask="0x00000030" name="ECCCON" values="CFGCON__ECCCON"/>
            <bitfield mask="0x00000080" name="IOANCPN"/>
            <bitfield caption="USB Suspend Sleep Enable bit(1)" mask="0x00000100" name="USBSSEN" values="CFGCON__USBSSEN"/>
            <bitfield caption="Permission Group Lock bit(1)" mask="0x00000800" name="PGLOCK" values="CFGCON__PGLOCK"/>
            <bitfield caption="Peripheral Module Disable bit(1)" mask="0x00001000" name="PMDLOCK" values="CFGCON__PMDLOCK"/>
            <bitfield caption="Peripheral Pin Select Lock bit(1)" mask="0x00002000" name="IOLOCK" values="CFGCON__IOLOCK"/>
            <bitfield caption="Output Compare Alternate Clock Selection bit(1)" mask="0x00010000" name="OCACLK" values="CFGCON__OCACLK"/>
            <bitfield caption="Input Capture Alternate Clock Selection bit(1)" mask="0x00020000" name="ICACLK" values="CFGCON__ICACLK"/>
            <bitfield caption="CPU Arbitration Priority to SRAM When Servicing an Interrupt bit(1)" mask="0x01000000" name="CPUPRI" values="CFGCON__CPUPRI"/>
            <bitfield caption="DMA Read and DMA Write Arbitration Priority to SRAM bit(1)" mask="0x02000000" name="DMAPRI" values="CFGCON__DMAPRI"/>
         </register>
         <register caption="Device and Revision ID Register" name="DEVID" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0FFFFFFF" name="DEVID"/>
            <bitfield mask="0xF0000000" name="VER"/>
         </register>
         <register caption="" name="SYSKEY" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SYSKEY"/>
         </register>
         <register caption="" name="PMD1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ADCMD"/>
            <bitfield mask="0x00001000" name="CVRMD"/>
         </register>
         <register caption="" name="PMD2" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1MD"/>
            <bitfield mask="0x00000002" name="CMP2MD"/>
         </register>
         <register caption="" name="PMD3" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="IC1MD"/>
            <bitfield mask="0x00000002" name="IC2MD"/>
            <bitfield mask="0x00000004" name="IC3MD"/>
            <bitfield mask="0x00000008" name="IC4MD"/>
            <bitfield mask="0x00000010" name="IC5MD"/>
            <bitfield mask="0x00000020" name="IC6MD"/>
            <bitfield mask="0x00000040" name="IC7MD"/>
            <bitfield mask="0x00000080" name="IC8MD"/>
            <bitfield mask="0x00000100" name="IC9MD"/>
            <bitfield mask="0x00010000" name="OC1MD"/>
            <bitfield mask="0x00020000" name="OC2MD"/>
            <bitfield mask="0x00040000" name="OC3MD"/>
            <bitfield mask="0x00080000" name="OC4MD"/>
            <bitfield mask="0x00100000" name="OC5MD"/>
            <bitfield mask="0x00200000" name="OC6MD"/>
            <bitfield mask="0x00400000" name="OC7MD"/>
            <bitfield mask="0x00800000" name="OC8MD"/>
            <bitfield mask="0x01000000" name="OC9MD"/>
         </register>
         <register caption="" name="PMD4" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="T1MD"/>
            <bitfield mask="0x00000002" name="T2MD"/>
            <bitfield mask="0x00000004" name="T3MD"/>
            <bitfield mask="0x00000008" name="T4MD"/>
            <bitfield mask="0x00000010" name="T5MD"/>
            <bitfield mask="0x00000020" name="T6MD"/>
            <bitfield mask="0x00000040" name="T7MD"/>
            <bitfield mask="0x00000080" name="T8MD"/>
            <bitfield mask="0x00000100" name="T9MD"/>
         </register>
         <register caption="" name="PMD5" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U1MD"/>
            <bitfield mask="0x00000002" name="U2MD"/>
            <bitfield mask="0x00000004" name="U3MD"/>
            <bitfield mask="0x00000008" name="U4MD"/>
            <bitfield mask="0x00000010" name="U5MD"/>
            <bitfield mask="0x00000020" name="U6MD"/>
            <bitfield mask="0x00000100" name="SPI1MD"/>
            <bitfield mask="0x00000200" name="SPI2MD"/>
            <bitfield mask="0x00000400" name="SPI3MD"/>
            <bitfield mask="0x00000800" name="SPI4MD"/>
            <bitfield mask="0x00001000" name="SPI5MD"/>
            <bitfield mask="0x00002000" name="SPI6MD"/>
            <bitfield mask="0x00010000" name="I2C1MD"/>
            <bitfield mask="0x00020000" name="I2C2MD"/>
            <bitfield mask="0x00040000" name="I2C3MD"/>
            <bitfield mask="0x00080000" name="I2C4MD"/>
            <bitfield mask="0x00100000" name="I2C5MD"/>
            <bitfield mask="0x01000000" name="USBMD"/>
            <bitfield mask="0x10000000" name="CAN1MD"/>
            <bitfield mask="0x20000000" name="CAN2MD"/>
         </register>
         <register caption="" name="PMD6" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RTCCMD"/>
            <bitfield mask="0x00000100" name="REFO1MD"/>
            <bitfield mask="0x00000200" name="REFO2MD"/>
            <bitfield mask="0x00000400" name="REFO3MD"/>
            <bitfield mask="0x00000800" name="REFO4MD"/>
            <bitfield mask="0x00010000" name="PMPMD"/>
            <bitfield mask="0x00020000" name="EBIMD"/>
            <bitfield mask="0x00800000" name="SQI1MD"/>
            <bitfield mask="0x10000000" name="ETHMD"/>
         </register>
         <register caption="" name="PMD7" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000010" name="DMAMD"/>
            <bitfield mask="0x00100000" name="RNGMD"/>
            <bitfield mask="0x00400000" name="CRYPTMD"/>
         </register>
         <register caption="External Bus Interface Address Pin Configuration Register" name="CFGEBIA" offset="0xc0" rw="RW" size="4">
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000001" name="EBIA0EN" values="CFGEBIA__EBIA0EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000002" name="EBIA1EN" values="CFGEBIA__EBIA1EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000004" name="EBIA2EN" values="CFGEBIA__EBIA2EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000008" name="EBIA3EN" values="CFGEBIA__EBIA3EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000010" name="EBIA4EN" values="CFGEBIA__EBIA4EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000020" name="EBIA5EN" values="CFGEBIA__EBIA5EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000040" name="EBIA6EN" values="CFGEBIA__EBIA6EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000080" name="EBIA7EN" values="CFGEBIA__EBIA7EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000100" name="EBIA8EN" values="CFGEBIA__EBIA8EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000200" name="EBIA9EN" values="CFGEBIA__EBIA9EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000400" name="EBIA10EN" values="CFGEBIA__EBIA10EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000800" name="EBIA11EN" values="CFGEBIA__EBIA11EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00001000" name="EBIA12EN" values="CFGEBIA__EBIA12EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00002000" name="EBIA13EN" values="CFGEBIA__EBIA13EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00004000" name="EBIA14EN" values="CFGEBIA__EBIA14EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00008000" name="EBIA15EN" values="CFGEBIA__EBIA15EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00010000" name="EBIA16EN" values="CFGEBIA__EBIA16EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00020000" name="EBIA17EN" values="CFGEBIA__EBIA17EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00040000" name="EBIA18EN" values="CFGEBIA__EBIA18EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00080000" name="EBIA19EN" values="CFGEBIA__EBIA19EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00100000" name="EBIA20EN" values="CFGEBIA__EBIA20EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00200000" name="EBIA21EN" values="CFGEBIA__EBIA21EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00400000" name="EBIA22EN" values="CFGEBIA__EBIA22EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00800000" name="EBIA23EN" values="CFGEBIA__EBIA23EN"/>
            <bitfield caption="EBI Pin Enable bit" mask="0x80000000" name="EBIPINEN" values="CFGEBIA__EBIPINEN"/>
         </register>
