Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFG144.atdf
      <value-group caption="RMII Speed bit" name="EMAC1SUPP__SPEEDRMII">
         <value caption="RMII is running at 100 Mbps" name="" value="0x1"/>
         <value caption="RMII is running at 10 Mbps" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reset RMII Logic bit" name="EMAC1SUPP__RESETRMII">
         <value caption="Reset the MAC RMII module" name="" value="0x1"/>
         <value caption="Normal operation." name="" value="0x0"/>
      </value-group>
      <value-group caption="Shortcut PAUSE Quanta bit" name="EMAC1TEST__SHRTQNTA">
         <value caption="The MAC reduces the effective PAUSE Quanta from 64 byte-times to 1 byte-time" name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test PAUSE bit" name="EMAC1TEST__TESTPAUSE">
         <value caption="The MAC Control sub-layer will inhibit transmissions" name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test Backpressure bit" name="EMAC1TEST__TESTBP">
         <value caption="The MAC will assert backpressure on the link. Backpressure causes preamble to be transmitted" name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Scan Increment bit" name="EMAC1MCFG__SCANINC">
         <value caption="The MII Management module will perform read cycles across a range of PHYs. The read cycles will start from address 1 through the value set in EMAC1MADR" name="" value="0x1"/>
         <value caption="Continuous reads of the same PHY" name="" value="0x0"/>
      </value-group>
      <value-group caption="Suppress Preamble bit" name="EMAC1MCFG__NOPRE">
         <value caption="The MII Management will perform read/write cycles without the 32-bit preamble field. Some PHYs support suppressed preamble" name="" value="0x1"/>
         <value caption="Normal read/write cycles are performed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test Reset MII Management bit" name="EMAC1MCFG__RESETMGMT">
         <value caption="Reset the MII Management module" name="" value="0x1"/>
         <value caption="Normal Operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="MII Management Read Command bit" name="EMAC1MCMD__READ">
         <value caption="The MII Management module will perform a single read cycle. The read data is returned in the EMAC1MRDD register" name="" value="0x1"/>
         <value caption="The MII Management module will perform a write cycle. The write data is taken from the EMAC1MWTD register" name="" value="0x0"/>
      </value-group>
      <value-group caption="MII Management Scan Mode bit" name="EMAC1MCMD__SCAN">
         <value caption="The MII Management module will perform read cycles continuously (for example" name="" value="0x1"/>
         <value caption="Normal Operation" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="02467" name="GPIO" version="1">
      <register-group name="GPIO">
         <register caption="" name="ANSELA" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSA0"/>
            <bitfield mask="0x00000002" name="ANSA1"/>
            <bitfield mask="0x00000004" name="ANSA2"/>
            <bitfield mask="0x00000008" name="ANSA3"/>
            <bitfield mask="0x00000010" name="ANSA4"/>
            <bitfield mask="0x00000020" name="ANSA5"/>
            <bitfield mask="0x00000040" name="ANSA6"/>
            <bitfield mask="0x00000080" name="ANSA7"/>
            <bitfield mask="0x00000100" name="ANSA8"/>
            <bitfield mask="0x00000200" name="ANSA9"/>
            <bitfield mask="0x00000400" name="ANSA10"/>
            <bitfield mask="0x00000800" name="ANSA11"/>
            <bitfield mask="0x00001000" name="ANSA12"/>
            <bitfield mask="0x00002000" name="ANSA13"/>
            <bitfield mask="0x00004000" name="ANSA14"/>
            <bitfield mask="0x00008000" name="ANSA15"/>
         </register>
         <register caption="" name="ANSELB" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSB0"/>
            <bitfield mask="0x00000002" name="ANSB1"/>
            <bitfield mask="0x00000004" name="ANSB2"/>
            <bitfield mask="0x00000008" name="ANSB3"/>
            <bitfield mask="0x00000010" name="ANSB4"/>
            <bitfield mask="0x00000020" name="ANSB5"/>
            <bitfield mask="0x00000040" name="ANSB6"/>
            <bitfield mask="0x00000080" name="ANSB7"/>
            <bitfield mask="0x00000100" name="ANSB8"/>
            <bitfield mask="0x00000200" name="ANSB9"/>
            <bitfield mask="0x00000400" name="ANSB10"/>
            <bitfield mask="0x00000800" name="ANSB11"/>
            <bitfield mask="0x00001000" name="ANSB12"/>
            <bitfield mask="0x00002000" name="ANSB13"/>
            <bitfield mask="0x00004000" name="ANSB14"/>
            <bitfield mask="0x00008000" name="ANSB15"/>
         </register>
         <register caption="" name="ANSELC" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSC0"/>
            <bitfield mask="0x00000002" name="ANSC1"/>
            <bitfield mask="0x00000004" name="ANSC2"/>
            <bitfield mask="0x00000008" name="ANSC3"/>
            <bitfield mask="0x00000010" name="ANSC4"/>
            <bitfield mask="0x00000020" name="ANSC5"/>
            <bitfield mask="0x00000040" name="ANSC6"/>
            <bitfield mask="0x00000080" name="ANSC7"/>
            <bitfield mask="0x00000100" name="ANSC8"/>
            <bitfield mask="0x00000200" name="ANSC9"/>
            <bitfield mask="0x00000400" name="ANSC10"/>
            <bitfield mask="0x00000800" name="ANSC11"/>
            <bitfield mask="0x00001000" name="ANSC12"/>
            <bitfield mask="0x00002000" name="ANSC13"/>
            <bitfield mask="0x00004000" name="ANSC14"/>
            <bitfield mask="0x00008000" name="ANSC15"/>
         </register>
         <register caption="" name="ANSELD" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSD0"/>
            <bitfield mask="0x00000002" name="ANSD1"/>
            <bitfield mask="0x00000004" name="ANSD2"/>
            <bitfield mask="0x00000008" name="ANSD3"/>
            <bitfield mask="0x00000010" name="ANSD4"/>
            <bitfield mask="0x00000020" name="ANSD5"/>
            <bitfield mask="0x00000040" name="ANSD6"/>
            <bitfield mask="0x00000080" name="ANSD7"/>
            <bitfield mask="0x00000100" name="ANSD8"/>
            <bitfield mask="0x00000200" name="ANSD9"/>
            <bitfield mask="0x00000400" name="ANSD10"/>
            <bitfield mask="0x00000800" name="ANSD11"/>
            <bitfield mask="0x00001000" name="ANSD12"/>
            <bitfield mask="0x00002000" name="ANSD13"/>
            <bitfield mask="0x00004000" name="ANSD14"/>
            <bitfield mask="0x00008000" name="ANSD15"/>
         </register>
         <register caption="" name="ANSELE" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSE0"/>
            <bitfield mask="0x00000002" name="ANSE1"/>
            <bitfield mask="0x00000004" name="ANSE2"/>
            <bitfield mask="0x00000008" name="ANSE3"/>
            <bitfield mask="0x00000010" name="ANSE4"/>
            <bitfield mask="0x00000020" name="ANSE5"/>
            <bitfield mask="0x00000040" name="ANSE6"/>
            <bitfield mask="0x00000080" name="ANSE7"/>
            <bitfield mask="0x00000100" name="ANSE8"/>
            <bitfield mask="0x00000200" name="ANSE9"/>
            <bitfield mask="0x00000400" name="ANSE10"/>
            <bitfield mask="0x00000800" name="ANSE11"/>
            <bitfield mask="0x00001000" name="ANSE12"/>
            <bitfield mask="0x00002000" name="ANSE13"/>
            <bitfield mask="0x00004000" name="ANSE14"/>
            <bitfield mask="0x00008000" name="ANSE15"/>
         </register>
         <register caption="" name="ANSELF" offset="0x500" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSF0"/>
            <bitfield mask="0x00000002" name="ANSF1"/>
            <bitfield mask="0x00000004" name="ANSF2"/>
            <bitfield mask="0x00000008" name="ANSF3"/>
            <bitfield mask="0x00000010" name="ANSF4"/>
            <bitfield mask="0x00000020" name="ANSF5"/>
            <bitfield mask="0x00000040" name="ANSF6"/>
            <bitfield mask="0x00000080" name="ANSF7"/>
            <bitfield mask="0x00000100" name="ANSF8"/>
            <bitfield mask="0x00000200" name="ANSF9"/>
            <bitfield mask="0x00000400" name="ANSF10"/>
            <bitfield mask="0x00000800" name="ANSF11"/>
            <bitfield mask="0x00001000" name="ANSF12"/>
            <bitfield mask="0x00002000" name="ANSF13"/>
            <bitfield mask="0x00004000" name="ANSF14"/>
            <bitfield mask="0x00008000" name="ANSF15"/>
         </register>
         <register caption="" name="ANSELG" offset="0x600" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSG0"/>
            <bitfield mask="0x00000002" name="ANSG1"/>
            <bitfield mask="0x00000004" name="ANSG2"/>
            <bitfield mask="0x00000008" name="ANSG3"/>
            <bitfield mask="0x00000010" name="ANSG4"/>
            <bitfield mask="0x00000020" name="ANSG5"/>
            <bitfield mask="0x00000040" name="ANSG6"/>
            <bitfield mask="0x00000080" name="ANSG7"/>
            <bitfield mask="0x00000100" name="ANSG8"/>
            <bitfield mask="0x00000200" name="ANSG9"/>
            <bitfield mask="0x00000400" name="ANSG10"/>
            <bitfield mask="0x00000800" name="ANSG11"/>
            <bitfield mask="0x00001000" name="ANSG12"/>
            <bitfield mask="0x00002000" name="ANSG13"/>
            <bitfield mask="0x00004000" name="ANSG14"/>
            <bitfield mask="0x00008000" name="ANSG15"/>
         </register>
         <register caption="" name="ANSELH" offset="0x700" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSH0"/>
            <bitfield mask="0x00000002" name="ANSH1"/>
            <bitfield mask="0x00000004" name="ANSH2"/>
            <bitfield mask="0x00000008" name="ANSH3"/>
            <bitfield mask="0x00000010" name="ANSH4"/>
            <bitfield mask="0x00000020" name="ANSH5"/>
            <bitfield mask="0x00000040" name="ANSH6"/>
            <bitfield mask="0x00000080" name="ANSH7"/>
            <bitfield mask="0x00000100" name="ANSH8"/>
            <bitfield mask="0x00000200" name="ANSH9"/>
            <bitfield mask="0x00000400" name="ANSH10"/>
            <bitfield mask="0x00000800" name="ANSH11"/>
            <bitfield mask="0x00001000" name="ANSH12"/>
            <bitfield mask="0x00002000" name="ANSH13"/>
            <bitfield mask="0x00004000" name="ANSH14"/>
            <bitfield mask="0x00008000" name="ANSH15"/>
         </register>
