Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFG144.atdf
         <register caption="" name="CNPUD" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUD0"/>
            <bitfield mask="0x00000002" name="CNPUD1"/>
            <bitfield mask="0x00000004" name="CNPUD2"/>
            <bitfield mask="0x00000008" name="CNPUD3"/>
            <bitfield mask="0x00000010" name="CNPUD4"/>
            <bitfield mask="0x00000020" name="CNPUD5"/>
            <bitfield mask="0x00000040" name="CNPUD6"/>
            <bitfield mask="0x00000080" name="CNPUD7"/>
            <bitfield mask="0x00000100" name="CNPUD8"/>
            <bitfield mask="0x00000200" name="CNPUD9"/>
            <bitfield mask="0x00000400" name="CNPUD10"/>
            <bitfield mask="0x00000800" name="CNPUD11"/>
            <bitfield mask="0x00001000" name="CNPUD12"/>
            <bitfield mask="0x00002000" name="CNPUD13"/>
            <bitfield mask="0x00004000" name="CNPUD14"/>
            <bitfield mask="0x00008000" name="CNPUD15"/>
         </register>
         <register caption="" name="CNPUE" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUE0"/>
            <bitfield mask="0x00000002" name="CNPUE1"/>
            <bitfield mask="0x00000004" name="CNPUE2"/>
            <bitfield mask="0x00000008" name="CNPUE3"/>
            <bitfield mask="0x00000010" name="CNPUE4"/>
            <bitfield mask="0x00000020" name="CNPUE5"/>
            <bitfield mask="0x00000040" name="CNPUE6"/>
            <bitfield mask="0x00000080" name="CNPUE7"/>
            <bitfield mask="0x00000100" name="CNPUE8"/>
            <bitfield mask="0x00000200" name="CNPUE9"/>
            <bitfield mask="0x00000400" name="CNPUE10"/>
            <bitfield mask="0x00000800" name="CNPUE11"/>
            <bitfield mask="0x00001000" name="CNPUE12"/>
            <bitfield mask="0x00002000" name="CNPUE13"/>
            <bitfield mask="0x00004000" name="CNPUE14"/>
            <bitfield mask="0x00008000" name="CNPUE15"/>
         </register>
         <register caption="" name="CNPUF" offset="0x550" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUF0"/>
            <bitfield mask="0x00000002" name="CNPUF1"/>
            <bitfield mask="0x00000004" name="CNPUF2"/>
            <bitfield mask="0x00000008" name="CNPUF3"/>
            <bitfield mask="0x00000010" name="CNPUF4"/>
            <bitfield mask="0x00000020" name="CNPUF5"/>
            <bitfield mask="0x00000040" name="CNPUF6"/>
            <bitfield mask="0x00000080" name="CNPUF7"/>
            <bitfield mask="0x00000100" name="CNPUF8"/>
            <bitfield mask="0x00000200" name="CNPUF9"/>
            <bitfield mask="0x00000400" name="CNPUF10"/>
            <bitfield mask="0x00000800" name="CNPUF11"/>
            <bitfield mask="0x00001000" name="CNPUF12"/>
            <bitfield mask="0x00002000" name="CNPUF13"/>
            <bitfield mask="0x00004000" name="CNPUF14"/>
            <bitfield mask="0x00008000" name="CNPUF15"/>
         </register>
         <register caption="" name="CNPUG" offset="0x650" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUG0"/>
            <bitfield mask="0x00000002" name="CNPUG1"/>
            <bitfield mask="0x00000004" name="CNPUG2"/>
            <bitfield mask="0x00000008" name="CNPUG3"/>
            <bitfield mask="0x00000010" name="CNPUG4"/>
            <bitfield mask="0x00000020" name="CNPUG5"/>
            <bitfield mask="0x00000040" name="CNPUG6"/>
            <bitfield mask="0x00000080" name="CNPUG7"/>
            <bitfield mask="0x00000100" name="CNPUG8"/>
            <bitfield mask="0x00000200" name="CNPUG9"/>
            <bitfield mask="0x00000400" name="CNPUG10"/>
            <bitfield mask="0x00000800" name="CNPUG11"/>
            <bitfield mask="0x00001000" name="CNPUG12"/>
            <bitfield mask="0x00002000" name="CNPUG13"/>
            <bitfield mask="0x00004000" name="CNPUG14"/>
            <bitfield mask="0x00008000" name="CNPUG15"/>
         </register>
         <register caption="" name="CNPUH" offset="0x750" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUH0"/>
            <bitfield mask="0x00000002" name="CNPUH1"/>
            <bitfield mask="0x00000004" name="CNPUH2"/>
            <bitfield mask="0x00000008" name="CNPUH3"/>
            <bitfield mask="0x00000010" name="CNPUH4"/>
            <bitfield mask="0x00000020" name="CNPUH5"/>
            <bitfield mask="0x00000040" name="CNPUH6"/>
            <bitfield mask="0x00000080" name="CNPUH7"/>
            <bitfield mask="0x00000100" name="CNPUH8"/>
            <bitfield mask="0x00000200" name="CNPUH9"/>
            <bitfield mask="0x00000400" name="CNPUH10"/>
            <bitfield mask="0x00000800" name="CNPUH11"/>
            <bitfield mask="0x00001000" name="CNPUH12"/>
            <bitfield mask="0x00002000" name="CNPUH13"/>
            <bitfield mask="0x00004000" name="CNPUH14"/>
            <bitfield mask="0x00008000" name="CNPUH15"/>
         </register>
         <register caption="" name="CNPUJ" offset="0x850" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUJ0"/>
            <bitfield mask="0x00000002" name="CNPUJ1"/>
            <bitfield mask="0x00000004" name="CNPUJ2"/>
            <bitfield mask="0x00000008" name="CNPUJ3"/>
            <bitfield mask="0x00000010" name="CNPUJ4"/>
            <bitfield mask="0x00000020" name="CNPUJ5"/>
            <bitfield mask="0x00000040" name="CNPUJ6"/>
            <bitfield mask="0x00000080" name="CNPUJ7"/>
            <bitfield mask="0x00000100" name="CNPUJ8"/>
            <bitfield mask="0x00000200" name="CNPUJ9"/>
            <bitfield mask="0x00000400" name="CNPUJ10"/>
            <bitfield mask="0x00000800" name="CNPUJ11"/>
            <bitfield mask="0x00001000" name="CNPUJ12"/>
            <bitfield mask="0x00002000" name="CNPUJ13"/>
            <bitfield mask="0x00004000" name="CNPUJ14"/>
            <bitfield mask="0x00008000" name="CNPUJ15"/>
         </register>
         <register caption="" name="CNPUK" offset="0x950" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUK0"/>
            <bitfield mask="0x00000002" name="CNPUK1"/>
            <bitfield mask="0x00000004" name="CNPUK2"/>
            <bitfield mask="0x00000008" name="CNPUK3"/>
            <bitfield mask="0x00000010" name="CNPUK4"/>
            <bitfield mask="0x00000020" name="CNPUK5"/>
            <bitfield mask="0x00000040" name="CNPUK6"/>
            <bitfield mask="0x00000080" name="CNPUK7"/>
            <bitfield mask="0x00000100" name="CNPUK8"/>
            <bitfield mask="0x00000200" name="CNPUK9"/>
            <bitfield mask="0x00000400" name="CNPUK10"/>
            <bitfield mask="0x00000800" name="CNPUK11"/>
            <bitfield mask="0x00001000" name="CNPUK12"/>
            <bitfield mask="0x00002000" name="CNPUK13"/>
            <bitfield mask="0x00004000" name="CNPUK14"/>
            <bitfield mask="0x00008000" name="CNPUK15"/>
         </register>
         <register caption="" name="CNPDA" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDA0"/>
            <bitfield mask="0x00000002" name="CNPDA1"/>
            <bitfield mask="0x00000004" name="CNPDA2"/>
            <bitfield mask="0x00000008" name="CNPDA3"/>
            <bitfield mask="0x00000010" name="CNPDA4"/>
            <bitfield mask="0x00000020" name="CNPDA5"/>
            <bitfield mask="0x00000040" name="CNPDA6"/>
            <bitfield mask="0x00000080" name="CNPDA7"/>
            <bitfield mask="0x00000100" name="CNPDA8"/>
            <bitfield mask="0x00000200" name="CNPDA9"/>
            <bitfield mask="0x00000400" name="CNPDA10"/>
            <bitfield mask="0x00000800" name="CNPDA11"/>
            <bitfield mask="0x00001000" name="CNPDA12"/>
            <bitfield mask="0x00002000" name="CNPDA13"/>
            <bitfield mask="0x00004000" name="CNPDA14"/>
            <bitfield mask="0x00008000" name="CNPDA15"/>
         </register>
         <register caption="" name="CNPDB" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDB0"/>
            <bitfield mask="0x00000002" name="CNPDB1"/>
            <bitfield mask="0x00000004" name="CNPDB2"/>
            <bitfield mask="0x00000008" name="CNPDB3"/>
            <bitfield mask="0x00000010" name="CNPDB4"/>
            <bitfield mask="0x00000020" name="CNPDB5"/>
            <bitfield mask="0x00000040" name="CNPDB6"/>
            <bitfield mask="0x00000080" name="CNPDB7"/>
            <bitfield mask="0x00000100" name="CNPDB8"/>
            <bitfield mask="0x00000200" name="CNPDB9"/>
            <bitfield mask="0x00000400" name="CNPDB10"/>
            <bitfield mask="0x00000800" name="CNPDB11"/>
            <bitfield mask="0x00001000" name="CNPDB12"/>
            <bitfield mask="0x00002000" name="CNPDB13"/>
            <bitfield mask="0x00004000" name="CNPDB14"/>
            <bitfield mask="0x00008000" name="CNPDB15"/>
         </register>
         <register caption="" name="CNPDC" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDC0"/>
            <bitfield mask="0x00000002" name="CNPDC1"/>
            <bitfield mask="0x00000004" name="CNPDC2"/>
            <bitfield mask="0x00000008" name="CNPDC3"/>
            <bitfield mask="0x00000010" name="CNPDC4"/>
            <bitfield mask="0x00000020" name="CNPDC5"/>
            <bitfield mask="0x00000040" name="CNPDC6"/>
            <bitfield mask="0x00000080" name="CNPDC7"/>
            <bitfield mask="0x00000100" name="CNPDC8"/>
            <bitfield mask="0x00000200" name="CNPDC9"/>
            <bitfield mask="0x00000400" name="CNPDC10"/>
            <bitfield mask="0x00000800" name="CNPDC11"/>
            <bitfield mask="0x00001000" name="CNPDC12"/>
            <bitfield mask="0x00002000" name="CNPDC13"/>
            <bitfield mask="0x00004000" name="CNPDC14"/>
            <bitfield mask="0x00008000" name="CNPDC15"/>
         </register>
         <register caption="" name="CNPDD" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDD0"/>
            <bitfield mask="0x00000002" name="CNPDD1"/>
            <bitfield mask="0x00000004" name="CNPDD2"/>
            <bitfield mask="0x00000008" name="CNPDD3"/>
            <bitfield mask="0x00000010" name="CNPDD4"/>
            <bitfield mask="0x00000020" name="CNPDD5"/>
            <bitfield mask="0x00000040" name="CNPDD6"/>
            <bitfield mask="0x00000080" name="CNPDD7"/>
            <bitfield mask="0x00000100" name="CNPDD8"/>
            <bitfield mask="0x00000200" name="CNPDD9"/>
            <bitfield mask="0x00000400" name="CNPDD10"/>
            <bitfield mask="0x00000800" name="CNPDD11"/>
            <bitfield mask="0x00001000" name="CNPDD12"/>
            <bitfield mask="0x00002000" name="CNPDD13"/>
            <bitfield mask="0x00004000" name="CNPDD14"/>
            <bitfield mask="0x00008000" name="CNPDD15"/>
         </register>
         <register caption="" name="CNPDE" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDE0"/>
            <bitfield mask="0x00000002" name="CNPDE1"/>
            <bitfield mask="0x00000004" name="CNPDE2"/>
            <bitfield mask="0x00000008" name="CNPDE3"/>
            <bitfield mask="0x00000010" name="CNPDE4"/>
            <bitfield mask="0x00000020" name="CNPDE5"/>
            <bitfield mask="0x00000040" name="CNPDE6"/>
            <bitfield mask="0x00000080" name="CNPDE7"/>
            <bitfield mask="0x00000100" name="CNPDE8"/>
            <bitfield mask="0x00000200" name="CNPDE9"/>
            <bitfield mask="0x00000400" name="CNPDE10"/>
            <bitfield mask="0x00000800" name="CNPDE11"/>
            <bitfield mask="0x00001000" name="CNPDE12"/>
            <bitfield mask="0x00002000" name="CNPDE13"/>
            <bitfield mask="0x00004000" name="CNPDE14"/>
            <bitfield mask="0x00008000" name="CNPDE15"/>
         </register>
         <register caption="" name="CNPDF" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDF0"/>
            <bitfield mask="0x00000002" name="CNPDF1"/>
            <bitfield mask="0x00000004" name="CNPDF2"/>
            <bitfield mask="0x00000008" name="CNPDF3"/>
            <bitfield mask="0x00000010" name="CNPDF4"/>
            <bitfield mask="0x00000020" name="CNPDF5"/>
            <bitfield mask="0x00000040" name="CNPDF6"/>
            <bitfield mask="0x00000080" name="CNPDF7"/>
            <bitfield mask="0x00000100" name="CNPDF8"/>
            <bitfield mask="0x00000200" name="CNPDF9"/>
            <bitfield mask="0x00000400" name="CNPDF10"/>
            <bitfield mask="0x00000800" name="CNPDF11"/>
            <bitfield mask="0x00001000" name="CNPDF12"/>
            <bitfield mask="0x00002000" name="CNPDF13"/>
            <bitfield mask="0x00004000" name="CNPDF14"/>
            <bitfield mask="0x00008000" name="CNPDF15"/>
         </register>
         <register caption="" name="CNPDG" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDG0"/>
            <bitfield mask="0x00000002" name="CNPDG1"/>
            <bitfield mask="0x00000004" name="CNPDG2"/>
            <bitfield mask="0x00000008" name="CNPDG3"/>
            <bitfield mask="0x00000010" name="CNPDG4"/>
            <bitfield mask="0x00000020" name="CNPDG5"/>
            <bitfield mask="0x00000040" name="CNPDG6"/>
            <bitfield mask="0x00000080" name="CNPDG7"/>
            <bitfield mask="0x00000100" name="CNPDG8"/>
            <bitfield mask="0x00000200" name="CNPDG9"/>
            <bitfield mask="0x00000400" name="CNPDG10"/>
            <bitfield mask="0x00000800" name="CNPDG11"/>
            <bitfield mask="0x00001000" name="CNPDG12"/>
            <bitfield mask="0x00002000" name="CNPDG13"/>
            <bitfield mask="0x00004000" name="CNPDG14"/>
            <bitfield mask="0x00008000" name="CNPDG15"/>
         </register>
         <register caption="" name="CNPDH" offset="0x760" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDH0"/>
            <bitfield mask="0x00000002" name="CNPDH1"/>
            <bitfield mask="0x00000004" name="CNPDH2"/>
            <bitfield mask="0x00000008" name="CNPDH3"/>
            <bitfield mask="0x00000010" name="CNPDH4"/>
            <bitfield mask="0x00000020" name="CNPDH5"/>
            <bitfield mask="0x00000040" name="CNPDH6"/>
            <bitfield mask="0x00000080" name="CNPDH7"/>
            <bitfield mask="0x00000100" name="CNPDH8"/>
            <bitfield mask="0x00000200" name="CNPDH9"/>
            <bitfield mask="0x00000400" name="CNPDH10"/>
            <bitfield mask="0x00000800" name="CNPDH11"/>
            <bitfield mask="0x00001000" name="CNPDH12"/>
            <bitfield mask="0x00002000" name="CNPDH13"/>
            <bitfield mask="0x00004000" name="CNPDH14"/>
            <bitfield mask="0x00008000" name="CNPDH15"/>
         </register>
