Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFG144.atdf
      <value-group caption="Ignore Receive Overflow bit" name="SPI4CON2__IGNROV">
         <value caption="A ROV is not a critical error; during ROV data in the fifo is not overwritten by receive data" name="" value="0x1"/>
         <value caption="A ROV is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI4CON2__SPITUREN">
         <value caption="Transmit Underrun Generates Error Events" name="" value="0x1"/>
         <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI4CON2__SPIROVEN">
         <value caption="Receive overflow generates error events" name="" value="0x1"/>
         <value caption="Receive overflow does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI4CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1"/>
         <value caption="Frame Error does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI4CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1"/>
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0"/>
      </value-group>
      <value-group caption="Audio Protocol Mode bit" name="SPI5CON2__AUDMOD">
         <value caption="PCM/DSP mode" name="" value="0x3"/>
         <value caption="Right Justified mode" name="" value="0x2"/>
         <value caption="Left Justified mode" name="" value="0x1"/>
         <value caption="I2S mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Audio Data Format bit" name="SPI5CON2__AUDMONO">
         <value caption="Audio data is mono (Each data word is transmitted on both left and right channels)" name="" value="0x1"/>
         <value caption="Audio data is stereo" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Audio CODEC Support bit" name="SPI5CON2__AUDEN">
         <value caption="Audio protocol enabled" name="" value="0x1"/>
         <value caption="Audio protocol disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ignore Transmit Underrun bit" name="SPI5CON2__IGNTUR">
         <value caption="A TUR is not a critical error and zeros are transmitted until the SPIxTXB is not empty" name="" value="0x1"/>
         <value caption="A TUR is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ignore Receive Overflow bit" name="SPI5CON2__IGNROV">
         <value caption="A ROV is not a critical error; during ROV data in the fifo is not overwritten by receive data" name="" value="0x1"/>
         <value caption="A ROV is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI5CON2__SPITUREN">
         <value caption="Transmit Underrun Generates Error Events" name="" value="0x1"/>
         <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI5CON2__SPIROVEN">
         <value caption="Receive overflow generates error events" name="" value="0x1"/>
         <value caption="Receive overflow does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI5CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1"/>
         <value caption="Frame Error does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI5CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1"/>
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0"/>
      </value-group>
      <value-group caption="Audio Protocol Mode bit" name="SPI6CON2__AUDMOD">
         <value caption="PCM/DSP mode" name="" value="0x3"/>
         <value caption="Right Justified mode" name="" value="0x2"/>
         <value caption="Left Justified mode" name="" value="0x1"/>
         <value caption="I2S mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Audio Data Format bit" name="SPI6CON2__AUDMONO">
         <value caption="Audio data is mono (Each data word is transmitted on both left and right channels)" name="" value="0x1"/>
         <value caption="Audio data is stereo" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Audio CODEC Support bit" name="SPI6CON2__AUDEN">
         <value caption="Audio protocol enabled" name="" value="0x1"/>
         <value caption="Audio protocol disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ignore Transmit Underrun bit" name="SPI6CON2__IGNTUR">
         <value caption="A TUR is not a critical error and zeros are transmitted until the SPIxTXB is not empty" name="" value="0x1"/>
         <value caption="A TUR is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ignore Receive Overflow bit" name="SPI6CON2__IGNROV">
         <value caption="A ROV is not a critical error; during ROV data in the fifo is not overwritten by receive data" name="" value="0x1"/>
         <value caption="A ROV is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI6CON2__SPITUREN">
         <value caption="Transmit Underrun Generates Error Events" name="" value="0x1"/>
         <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI6CON2__SPIROVEN">
         <value caption="Receive overflow generates error events" name="" value="0x1"/>
         <value caption="Receive overflow does not generate error events" name="" value="0x0"/>
      </value-group>
