Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFG144.atdf
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U4MODE__WAKE">
         <value caption="Wake-up is enabled" name="" value="0x1"/>
         <value caption="Wake-up is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bits" name="U4MODE__UEN">
         <value caption="UxTX" name="" value="0x3"/>
         <value caption="UxTX" name="" value="0x2"/>
         <value caption="UxTX" name="" value="0x1"/>
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U4MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1"/>
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="IrDA Encoder and Decoder Enable bit" name="U4MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1"/>
         <value caption="IrDA is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U4MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1"/>
         <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bit" name="U4MODE__ON">
         <value caption="UARTx is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1"/>
         <value caption="UARTx is disabled. All UARTx pins are controlled by corresponding bits in the PORTx" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop Selection bit" name="U5MODE__STSEL">
         <value caption="2 Stop bits" name="" value="0x1"/>
         <value caption="1 Stop bit" name="" value="0x0"/>
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U5MODE__PDSEL">
         <value caption="9-bit data" name="" value="0x3"/>
         <value caption="8-bit data" name="" value="0x2"/>
         <value caption="8-bit data" name="" value="0x1"/>
         <value caption="8-bit data" name="" value="0x0"/>
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U5MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1"/>
         <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U5MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1"/>
         <value caption="UxRX Idle state is 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U5MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1"/>
         <value caption="Baud rate measurement is disabled or completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U5MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1"/>
         <value caption="Loopback mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U5MODE__WAKE">
         <value caption="Wake-up is enabled" name="" value="0x1"/>
         <value caption="Wake-up is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bits" name="U5MODE__UEN">
         <value caption="UxTX" name="" value="0x3"/>
         <value caption="UxTX" name="" value="0x2"/>
         <value caption="UxTX" name="" value="0x1"/>
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U5MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1"/>
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="IrDA Encoder and Decoder Enable bit" name="U5MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1"/>
         <value caption="IrDA is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U5MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1"/>
         <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Enable bit" name="U5MODE__ON">
         <value caption="UARTx is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1"/>
         <value caption="UARTx is disabled. All UARTx pins are controlled by corresponding bits in the PORTx" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop Selection bit" name="U6MODE__STSEL">
         <value caption="2 Stop bits" name="" value="0x1"/>
         <value caption="1 Stop bit" name="" value="0x0"/>
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U6MODE__PDSEL">
         <value caption="9-bit data" name="" value="0x3"/>
         <value caption="8-bit data" name="" value="0x2"/>
         <value caption="8-bit data" name="" value="0x1"/>
         <value caption="8-bit data" name="" value="0x0"/>
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U6MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1"/>
         <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U6MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1"/>
         <value caption="UxRX Idle state is 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U6MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1"/>
         <value caption="Baud rate measurement is disabled or completed" name="" value="0x0"/>
      </value-group>
